# Group by

##### Импорт библиотек

In [1]:
import pandas as pd
import numpy as np
import sqlite3

In [2]:
sqlite3.sqlite_version

'3.39.4'

##### Подключение к БД

In [3]:
con = sqlite3.connect('db')

## Colab

In [5]:
! gdown --id 1cUYNwlHjUZ6gZZMSFBdX0NCnvgRTprsQ

df = pd.read_csv('/content/german_credit_augmented.csv')

"gdown" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

FileNotFoundError: [Errno 2] No such file or directory: '/content/german_credit_augmented.csv'

## Pycharm

In [4]:
df = pd.read_csv(
    r'C:\PyCharm\Python\SQL_for_data_analysis\2.DB_connect_and_upload\sql-course-main\german_credit_augmented.csv')

In [5]:
df

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,NaN,NaN,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,NaN,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,NaN,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,NaN,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,NaN,NaN,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

In [6]:
df.dtypes

age                  int64
sex                 object
job                  int64
housing             object
saving_accounts     object
checking_account    object
credit_amount        int64
duration             int64
purpose             object
default              int64
contract_dt         object
client_id            int64
dtype: object

In [7]:
df.contract_dt = pd.to_datetime(df.contract_dt, format='%Y-%m-%d %H:%M:%S')

In [8]:
df.dtypes

age                          int64
sex                         object
job                          int64
housing                     object
saving_accounts             object
checking_account            object
credit_amount                int64
duration                     int64
purpose                     object
default                      int64
contract_dt         datetime64[ns]
client_id                    int64
dtype: object

In [9]:
df.to_sql('german_credit', con, index=False, if_exists='replace')

1000

## Select

In [10]:
def select(sql):
    return pd.read_sql(sql, con)

In [11]:
sql = '''select * from german_credit t'''

In [12]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

## Group by

In [13]:
sql = '''SELECT t.sex,
count(*),
avg(t.credit_amount) AS credit_amount_avg

FROM german_credit t
GROUP BY sex'''

In [14]:
select(sql)

      sex  count(*)  credit_amount_avg
0  female       310        2877.774194
1    male       690        3448.040580

То же самое но в pandas

In [15]:
df.groupby('sex').credit_amount.agg(['count', 'mean'])

        count         mean
sex
female    310  2877.774194
male      690  3448.040580

#### Подсчёт уникальных значений

In [16]:
sql = '''select distinct t.housing from german_credit t'''

In [17]:
select(sql)

  housing
0     own
1    rent
2    free

In [18]:
sql = '''SELECT t.housing,
count(*),
avg(t.credit_amount) AS credit_amount_avg

FROM german_credit t
GROUP BY t.housing'''

In [19]:
select(sql)

  housing  count(*)  credit_amount_avg
0    free       108        4906.212963
1     own       713        3060.939691
2    rent       179        3122.553073

In [20]:
sql = '''select * from german_credit t'''

In [21]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

Посмотрим ещё один столбец, например checking account

In [22]:
sql = '''select t.checking_account from german_credit t'''

In [23]:
select(sql)

    checking_account
0               None
1             little
2               None
3               None
4               None
..               ...
995           little
996         moderate
997         moderate
998             None
999         moderate

[1000 rows x 1 columns]

Проверка на пропуски
Количество введённых данных и количество строк всего

In [24]:
sql = '''select count(t.checking_account), count(*) from german_credit t'''

In [25]:
select(sql)

   count(t.checking_account)  count(*)
0                        606      1000

Добавим чекинг аккаунт в сводник

In [26]:
sql = '''SELECT t.checking_account,
count(*),
avg(t.credit_amount) AS credit_amount_avg

FROM german_credit t
GROUP BY t.checking_account'''

In [27]:
select(sql)

  checking_account  count(*)  credit_amount_avg
0             None       394        3133.101523
1           little       274        3175.218978
2         moderate       269        3827.561338
3             rich        63        2177.650794

SQL УЧИТЫВАЕТ пропуски по умолчанию
Pandas НЕ УЧИТЫВАЕТ пропуски по умолчанию

In [28]:
df.groupby('checking_account').credit_amount.count()

checking_account
little      274
moderate    269
rich         63
Name: credit_amount, dtype: int64

In [29]:
df.groupby('checking_account').credit_amount.count().sum()

606

Для учёта пропусков в Pandas нужно прописывать dropna=False

In [30]:
df.groupby('checking_account', dropna=False).credit_amount.count()

checking_account
little      274
moderate    269
rich         63
NaN         394
Name: credit_amount, dtype: int64

Посмотрим количество пропусков, а не количество заполненых значений
Сначала добавим поле если есть пропуск
Затем проссумируем строки

In [31]:
sql = '''select t.checking_account,
case when t.checking_account is null then 1 else 0 end

from german_credit t'''

In [32]:
select(sql)

    checking_account  case when t.checking_account is null then 1 else 0 end
0               None                                                  1
1             little                                                  0
2               None                                                  1
3               None                                                  1
4               None                                                  1
..               ...                                                ...
995           little                                                  0
996         moderate                                                  0
997         moderate                                                  0
998             None                                                  1
999         moderate                                                  0

[1000 rows x 2 columns]

Подсчёт пропусков через sum и через count

In [33]:
sql = '''select
sum(case when t.checking_account is null then 1 else 0 end) as is_null,
count(case when t.checking_account is null then 1 else null end) as is_null2
from german_credit t'''

In [34]:
select(sql)

   is_null  is_null2
0      394       394

 Создадим искусственную таблицу для тренировки

In [35]:
t = pd.DataFrame({'col1': [1, np.nan, 2]})

In [36]:
t

   col1
0   1.0
1   NaN
2   2.0

In [37]:
t.to_sql('null_test', con, index=False, if_exists='replace')

3

In [38]:
sql = '''select * from null_test t '''

In [39]:
select(sql)

   col1
0   1.0
1   NaN
2   2.0

Показывает 2 значения, пропуск игнорирует

In [40]:
sql = '''select count(t.col1) from null_test t'''

In [41]:
select(sql)

   count(t.col1)
0              2

В сумме также игнорирует пропуск

In [42]:
sql = '''select sum(t.col1) from null_test t'''

In [43]:
select(sql)

   sum(t.col1)
0          3.0

В среднем так же игнорирует пропуск

In [44]:
sql = '''select avg(t.col1) from null_test t'''

In [45]:
select(sql)

   avg(t.col1)
0          1.5

#### Заполнение пропусков

In [46]:
sql = '''select
t.checking_account


from german_credit t'''

In [47]:
select(sql)

    checking_account
0               None
1             little
2               None
3               None
4               None
..               ...
995           little
996         moderate
997         moderate
998             None
999         moderate

[1000 rows x 1 columns]

Подставляем no_info вместо None

In [48]:
sql = '''select
t.checking_account,
coalesce(t.checking_account, 'no_info')

from german_credit t'''

In [49]:
select(sql)

    checking_account coalesce(t.checking_account, 'no_info')
0               None                                 no_info
1             little                                  little
2               None                                 no_info
3               None                                 no_info
4               None                                 no_info
..               ...                                     ...
995           little                                  little
996         moderate                                moderate
997         moderate                                moderate
998             None                                 no_info
999         moderate                                moderate

[1000 rows x 2 columns]

Ещё один пример
Пропуски заменим нулями

In [50]:
sql = '''select * from null_test t '''

In [51]:
select(sql)

   col1
0   1.0
1   NaN
2   2.0

In [52]:
sql = '''select coalesce(t.col1,0) as col1_whithout_none

from null_test t '''

In [53]:
select(sql)

   col1_whithout_none
0                 1.0
1                 0.0
2                 2.0

Теперь можно посчитать по данной таблице среднее и она будет учитывать новый нуль

In [54]:
sql = '''select avg(coalesce(t.col1,0)) as col1_whithout_none

from null_test t '''

In [55]:
select(sql)

   col1_whithout_none
0                 1.0

Дополним таблицу

In [56]:
t = pd.DataFrame({'col1': [1, np.nan, 2],
                  'col2': [np.nan, np.nan, 1],
                  'col3': [1, 2, 3]})

In [57]:
t

   col1  col2  col3
0   1.0   NaN     1
1   NaN   NaN     2
2   2.0   1.0     3

In [58]:
t.to_sql('null_test', con, index=False, if_exists='replace')

3

In [59]:
sql = '''select * from null_test t'''

In [60]:
select(sql)

   col1  col2  col3
0   1.0   NaN     1
1   NaN   NaN     2
2   2.0   1.0     3

Выберем столбец, который первый не имеет пропусков, начиная с первого и т.д.

In [61]:
sql = '''select t.*, coalesce(t.col1,t.col2,t.col3) from null_test t'''

In [62]:
select(sql)

   col1  col2  col3  coalesce(t.col1,t.col2,t.col3)
0   1.0   NaN     1                             1.0
1   NaN   NaN     2                             2.0
2   2.0   1.0     3                             2.0

## Дубликаты

In [63]:
t = pd.DataFrame({'id': [1, 1, 2], 'name': ['a', 'a', 'b']})

In [64]:
t

   id name
0   1    a
1   1    a
2   2    b

In [65]:
t.to_sql('dupl_test', con, index=False, if_exists='replace')

3

In [66]:
sql = '''select * from dupl_test t'''

In [67]:
select(sql)

   id name
0   1    a
1   1    a
2   2    b

In [68]:
sql = '''select t.id, t.name, count(*) as cnt from dupl_test t
group by t.id, t.name'''

In [69]:
select(sql)

   id name  cnt
0   1    a    2
1   2    b    1

Вывод строки, где есть дубликаты, то есть cnt > 1

In [70]:
sql = '''select t.id, t.name, count(*) as cnt from dupl_test t
group by t.id, t.name
having cnt > 1
'''

In [71]:
select(sql)

   id name  cnt
0   1    a    2

In [72]:
t = pd.DataFrame({'id': [1, 1, 2, 2, 3],
                  'name': ['a', 'c', 'b', 'd', 'e']})

In [73]:
t

   id name
0   1    a
1   1    c
2   2    b
3   2    d
4   3    e

In [74]:
t.to_sql('dupl_test', con, index=False, if_exists='replace')

5

In [75]:
sql = '''select * from dupl_test t'''

Дубликатов в имени нет, но есть дубликаты в id

In [76]:
select(sql)

   id name
0   1    a
1   1    c
2   2    b
3   2    d
4   3    e

Для того, чтобы найти повторяющиеся id нужно:

In [77]:
sql = '''select t.id, count(*) as cnt from dupl_test t
group by t.id
having cnt > 1
'''

In [78]:
select(sql)

   id  cnt
0   1    2
1   2    2

Для того, чтобы вывести инфу о дубликатах нужно написать подзапрос

In [79]:
sql = '''select * from dupl_test t
where t.id in(select t.id as cnt from dupl_test t
group by t.id
having count(*) > 1)
'''

In [80]:
select(sql)

   id name
0   1    a
1   1    c
2   2    b
3   2    d

## Агрегация

In [81]:
sql = '''select * from german_credit t'''

In [82]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

Агрегация по дате по началу месяца

In [83]:
sql = '''select date(t.contract_dt, 'start of month') as month,
count(*) as credit_cnt

from german_credit t
group by month
'''

In [84]:
select(sql)

         month  credit_cnt
0   2007-05-01          81
1   2007-06-01          74
2   2007-07-01          71
3   2007-08-01          57
4   2007-09-01          58
5   2007-10-01          70
6   2007-11-01          87
7   2007-12-01          77
8   2008-01-01          93
9   2008-02-01          55
10  2008-03-01          63
11  2008-04-01          85
12  2008-05-01          67
13  2008-06-01          62

Если не работает group by month ту нужно указывать дату полностью
Также можно добавить: сумму всех кредитов, среднюю сумму кредита, уникальные id клиента

In [85]:
sql = '''select date(t.contract_dt, 'start of month') as month,
count(*) as credit_cnt,
count(distinct t.client_id) as id_unique,
sum(t.credit_amount) as credit_amount_sum,
avg(t.credit_amount) as credit_amount_avg


from german_credit t
group by date(t.contract_dt, 'start of month')
order by date(t.contract_dt, 'start of month')
'''

In [86]:
select(sql)

         month  credit_cnt  id_unique  credit_amount_sum  credit_amount_avg
0   2007-05-01          81         81             207663        2563.740741
1   2007-06-01          74         74             239594        3237.756757
2   2007-07-01          71         71             224333        3159.619718
3   2007-08-01          57         57             178569        3132.789474
4   2007-09-01          58         58             186909        3222.568966
5   2007-10-01          70         70             188534        2693.342857
6   2007-11-01          87         87             300504        3454.068966
7   2007-12-01          77         77             273973        3558.090909
8   2008-01-01          93         93             288080        3097.634409
9   2008-02-01          55         55             211128        3838.690909
10  2008-03-01          63         63             204944        3253.079365
11  2008-04-01          85         85             305409        3593.047059
12  2008-05-01          67         67             263043        3926.014925
13  2008-06-01          62         62             198575        3202.822581

Создадим ситуацию, где не все id - уникальные

In [87]:
pd.Series(range(600)).sample(1000, replace=True)

238    238
416    416
98      98
505    505
577    577
      ...
599    599
123    123
255    255
498    498
19      19
Length: 1000, dtype: int64

In [88]:
df['client_id_2'] = pd.Series(range(600)).sample(1000, replace=True).values

In [89]:
df.to_sql('german_credit_not_unique', con, index=False, if_exists='replace')

1000

In [90]:
sql = '''select date(t.contract_dt, 'start of month') as month,
count(*) as credit_cnt,
count(distinct t.client_id_2) as id_unique,
sum(t.credit_amount) as credit_amount_sum,
avg(t.credit_amount) as credit_amount_avg


from german_credit_not_unique t
group by date(t.contract_dt, 'start of month')
order by date(t.contract_dt, 'start of month')
'''

In [91]:
select(sql)

         month  credit_cnt  id_unique  credit_amount_sum  credit_amount_avg
0   2007-05-01          81         74             207663        2563.740741
1   2007-06-01          74         69             239594        3237.756757
2   2007-07-01          71         66             224333        3159.619718
3   2007-08-01          57         55             178569        3132.789474
4   2007-09-01          58         57             186909        3222.568966
5   2007-10-01          70         66             188534        2693.342857
6   2007-11-01          87         78             300504        3454.068966
7   2007-12-01          77         76             273973        3558.090909
8   2008-01-01          93         83             288080        3097.634409
9   2008-02-01          55         51             211128        3838.690909
10  2008-03-01          63         58             204944        3253.079365
11  2008-04-01          85         75             305409        3593.047059
12  2008-05-01          67         65             263043        3926.014925
13  2008-06-01          62         56             198575        3202.822581

## Интервалы (бины или бакеты)

Посчитаем уникальные значения credit amount

In [92]:
sql = '''select count(distinct t.credit_amount) from german_credit t'''

In [93]:
select(sql)

   count(distinct t.credit_amount)
0                              921

Т.к. уникальных значений очень много, имеет смысл разбить их на интервалы

In [94]:
sql = '''select credit_amount,
case when t.credit_amount < 1000 then '1. < 1000'
when t.credit_amount < 2000 then '2. 1000 - 2000'
when t.credit_amount < 3000 then '3. 2000 - 3000'
when t.credit_amount >= 3000 then '4. >= 3000'

else 'other' end as credit_amount_bin

from german_credit t'''

In [95]:
select(sql)

     credit_amount credit_amount_bin
0             3074        4. >= 3000
1             1344    2. 1000 - 2000
2              936         1. < 1000
3             1393    2. 1000 - 2000
4              776         1. < 1000
..             ...               ...
995           2600    3. 2000 - 3000
996           4455        4. >= 3000
997           6403        4. >= 3000
998           5003        4. >= 3000
999           1804    2. 1000 - 2000

[1000 rows x 2 columns]

Количество кредитов в каждой категории:

In [96]:
sql = '''select
case when t.credit_amount < 1000 then '1. < 1000'
when t.credit_amount < 2000 then '2. 1000 - 2000'
when t.credit_amount < 3000 then '3. 2000 - 3000'
when t.credit_amount >= 3000 then '4. >= 3000'

else 'other' end as credit_amount_bin,

count(*)

from german_credit t
group by case when t.credit_amount < 1000 then '1. < 1000'
when t.credit_amount < 2000 then '2. 1000 - 2000'
when t.credit_amount < 3000 then '3. 2000 - 3000'
when t.credit_amount >= 3000 then '4. >= 3000'

else 'other' end'''

In [97]:
select(sql)

  credit_amount_bin  count(*)
0         1. < 1000       116
1    2. 1000 - 2000       316
2    3. 2000 - 3000       188
3        4. >= 3000       380

Запрос можно записать менее явно:

In [98]:
sql = '''select

case
when t.credit_amount < 1000 then '1. <1000'
when t.credit_amount < 2000 then '2. 1000-2000'
when t.credit_amount < 3000 then '3. 2000-3000'
when t.credit_amount >= 3000 then '4. >= 3000'

else 'other' end as credit_amount_bin,

count(*) as credit_cnt

 from german_credit t
 group by credit_amount_bin
 '''

In [99]:
select(sql)

  credit_amount_bin  credit_cnt
0          1. <1000         116
1      2. 1000-2000         316
2      3. 2000-3000         188
3        4. >= 3000         380

## Столбцы сводной таблицы

Поработаем со сводными таблицами

In [100]:
sql = '''select * from german_credit t'''

In [101]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

In [102]:
sql = '''select t.housing, count(*) as cnt from german_credit t
group by t.housing'''

In [103]:
select(sql)

  housing  cnt
0    free  108
1     own  713
2    rent  179

In [104]:
sql = '''select t.housing,
count (case when t.sex = 'female' then 1 else null end) as female,
count (case when t.sex = 'male' then 1 else null end) as male,


count(*) as cnt from german_credit t
group by t.housing'''

In [105]:
select(sql)

  housing  female  male  cnt
0    free      19    89  108
1     own     196   517  713
2    rent      95    84  179

Посмотрим уникальные значение целей кредита

In [106]:
sql = '''select distinct t.purpose from german_credit t'''

In [107]:
select(sql)

               purpose
0             radio/TV
1                  car
2            education
3  furniture/equipment
4              repairs
5             business
6  domestic appliances
7      vacation/others

Сохраним селект в список

In [108]:
purpose = list(select(sql)['purpose'].values)

In [109]:
purpose

['radio/TV',
 'car',
 'education',
 'furniture/equipment',
 'repairs',
 'business',
 'domestic appliances',
 'vacation/others']

In [110]:
for p in purpose:
    print(f"count(case when t.purpose = '{p}' then 1 else null end) as {p.lower().replace(' ', '').replace('/','')},")

count(case when t.purpose = 'radio/TV' then 1 else null end) as radiotv,
count(case when t.purpose = 'car' then 1 else null end) as car,
count(case when t.purpose = 'education' then 1 else null end) as education,
count(case when t.purpose = 'furniture/equipment' then 1 else null end) as furnitureequipment,
count(case when t.purpose = 'repairs' then 1 else null end) as repairs,
count(case when t.purpose = 'business' then 1 else null end) as business,
count(case when t.purpose = 'domestic appliances' then 1 else null end) as domesticappliances,
count(case when t.purpose = 'vacation/others' then 1 else null end) as vacationothers,

In [111]:
sql = '''select t.housing,
count(case when t.purpose = 'radio/TV' then 1 else null end) as radiotv,
count(case when t.purpose = 'car' then 1 else null end) as car,
count(case when t.purpose = 'education' then 1 else null end) as education,
count(case when t.purpose = 'furniture/equipment' then 1 else null end) as furnitureequipment,
count(case when t.purpose = 'repairs' then 1 else null end) as repairs,
count(case when t.purpose = 'business' then 1 else null end) as business,
count(case when t.purpose = 'domestic appliances' then 1 else null end) as domesticappliances,
count(case when t.purpose = 'vacation/others' then 1 else null end) as vacationothers,

count(*) as cnt from german_credit t
group by t.housing'''

In [112]:
select(sql)

,housing,radiotv,car,education,furnitureequipment,repairs,business,domesticappliances,vacationothers,cnt
0,free,15,55,15,11,3,5,0,4,108
1,own,227,219,34,122,17,76,10,8,713
2,rent,38,63,10,48,2,16,2,0,179

## Категории из текстовых данных

Создадим таблицу с 1-им столбцом и зальём её в SQL

In [113]:
t = pd.DataFrame({'purpose':['машина','машина','машина','на машину','на покупку машины',
                             'автомобиль','на возвращение 2007',
                             'на свадьбу','свадьба','свадьба','свадьба','для свадьбы',
                             'недвижимость','на покупку недвижимости']})

In [114]:
t

                    purpose
0                    машина
1                    машина
2                    машина
3                 на машину
4         на покупку машины
5                автомобиль
6       на возвращение 2007
7                на свадьбу
8                   свадьба
9                   свадьба
10                  свадьба
11              для свадьбы
12             недвижимость
13  на покупку недвижимости

In [115]:
t.to_sql('purpose', con, index=False, if_exists='replace')

14

In [116]:
df.head()

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id,client_id_2
0,33,male,2,own,NaN,NaN,3074,9,radio/TV,0,2008-06-29 18:52:00,210,503
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929,514
2,52,male,2,own,quite rich,NaN,936,9,education,0,2008-04-27 08:23:07,200,525
3,35,female,3,own,little,NaN,1393,11,car,0,2007-05-06 10:58:22,45,63
4,28,male,2,own,little,NaN,776,12,radio/TV,0,2007-07-21 13:22:14,358,162

In [117]:
sql = '''select * from purpose t'''

In [118]:
select(sql)

                    purpose
0                    машина
1                    машина
2                    машина
3                 на машину
4         на покупку машины
5                автомобиль
6       на возвращение 2007
7                на свадьбу
8                   свадьба
9                   свадьба
10                  свадьба
11              для свадьбы
12             недвижимость
13  на покупку недвижимости

Начнём с агрегации части всех слов

In [119]:
sql = '''select t.purpose,
case when t.purpose like '%свадьб%' then 'свадьба'
else 'другое' end as purpose_cut


from purpose t'''

In [120]:
select(sql)

                    purpose purpose_cut
0                    машина      другое
1                    машина      другое
2                    машина      другое
3                 на машину      другое
4         на покупку машины      другое
5                автомобиль      другое
6       на возвращение 2007      другое
7                на свадьбу     свадьба
8                   свадьба     свадьба
9                   свадьба     свадьба
10                  свадьба     свадьба
11              для свадьбы     свадьба
12             недвижимость      другое
13  на покупку недвижимости      другое

Посчитаем количество свадьб и других мероприятий

In [121]:
sql = '''select
case when t.purpose like '%свадьб%' then 'свадьба'
else 'другое' end as purpose_cut,
count(*)

from purpose t
group by 1'''

In [122]:
select(sql)

  purpose_cut  count(*)
0      другое         9
1     свадьба         5

Посчитаем количество различных мероприятий

In [ ]:
sql = '''select t.purpose, count(*)
from purpose t


group by t.purpose
order by count(*) desc'''

In [143]:
select(sql)

                   purpose  count(*)
0                  свадьба         3
1                   машина         3
2             недвижимость         1
3               на свадьбу         1
4  на покупку недвижимости         1
5        на покупку машины         1
6                на машину         1
7      на возвращение 2007         1
8              для свадьбы         1
9               автомобиль         1

In [160]:
sql = '''select t.purpose, count(*)
from (select t.purpose,
case when t.purpose like '%свадьб%' then 'свадьба'
else 'другое' end as purpose_cut
from purpose t) t
where t.purpose_cut = 'другое'


group by t.purpose
order by count(*) desc'''

In [161]:
select(sql)

                   purpose  count(*)
0                   машина         3
1             недвижимость         1
2  на покупку недвижимости         1
3        на покупку машины         1
4                на машину         1
5      на возвращение 2007         1
6               автомобиль         1

Помимо свадеб добавим в запрос машины и атомобили

In [156]:
sql = '''select t.purpose,
case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
else 'другое' end as purpose_cut


from purpose t'''

In [157]:
select(sql)

                    purpose purpose_cut
0                    машина      машина
1                    машина      машина
2                    машина      машина
3                 на машину      машина
4         на покупку машины      машина
5                автомобиль      машина
6       на возвращение 2007      другое
7                на свадьбу     свадьба
8                   свадьба     свадьба
9                   свадьба     свадьба
10                  свадьба     свадьба
11              для свадьбы     свадьба
12             недвижимость      другое
13  на покупку недвижимости      другое

Посмотрим, что осталось

In [192]:
sql = '''select t.purpose, count(*)
from (select t.purpose,
case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
else 'другое' end as purpose_cut
from purpose t) t
where t.purpose_cut = 'другое'


group by t.purpose
order by count(*) desc'''

In [193]:
select(sql)

                   purpose  count(*)
0             недвижимость         1
1  на покупку недвижимости         1
2      на возвращение 2007         1

In [208]:
cat = '''select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
when t.purpose like '%недвиж%' then 'недвижимость'

else 'другое' end as purpose_cat

 from purpose t'''

select(cat)

                    purpose   purpose_cat
0                    машина        машина
1                    машина        машина
2                    машина        машина
3                 на машину        машина
4         на покупку машины        машина
5                автомобиль        машина
6       на возвращение 2007        другое
7                на свадьбу       свадьба
8                   свадьба       свадьба
9                   свадьба       свадьба
10                  свадьба       свадьба
11              для свадьбы       свадьба
12             недвижимость  недвижимость
13  на покупку недвижимости  недвижимость

In [209]:
sql = f'''select
t.purpose_cat,

count(*)

 from ({cat}) t
 group by t.purpose_cat'''

select(sql)

    purpose_cat  count(*)
0        другое         1
1        машина         6
2  недвижимость         2
3       свадьба         5

In [206]:
sql = f'''select t.purpose, count(1)

from ({cat}) t
where t.purpose_cat = 'другое'


group by t.purpose

order by count(1) desc'''

In [207]:
select(sql)

               purpose  count(1)
0  на возвращение 2007         1